In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("../files/titanic.csv")

In [3]:
data.sample(5)

    Cabin    Ticket number  Survived
340    F2    230080      A         1
704   NaN    350025      5         0
632   B50     13214      5         1
375   NaN  PC 17604      1         1
522   NaN      2624      2         0

In [4]:
data.number.unique()

array(['5', '3', '6', 'A', '2', '1', '4'], dtype=object)

pd.to_numeric ==> Converts values to numeric(int or float)
erros="coerce" ==> Converts non-numeric values to NaN (avoids errors)
downcast="integer" ==> Converts numbers to the smallest possible integer type (int8, int16, etc.) to save memory

In [7]:
# extract numerical part
data["number_numerical"] = pd.to_numeric(
    data["number"], errors="coerce", downcast="integer"
)

data.head()

  Cabin            Ticket number  Survived  number_numerical
0   NaN         A/5 21171      5         0               5.0
1   C85          PC 17599      3         1               3.0
2   NaN  STON/O2. 3101282      6         1               6.0
3  C123            113803      3         1               3.0
4   NaN            373450      A         0               NaN

np.where(condition, value_if_true, value_if_false) ==> Applies a condition-based transformation.

In [8]:
# extract categorical part
data["number_categotrial"] = np.where(
    data["number_numerical"].isnull(), data["number"], np.nan
)

data.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categotrial
0,NaN,A/5 21171,5,0,5.0,NaN
1,C85,PC 17599,3,1,3.0,NaN
2,NaN,STON/O2. 3101282,6,1,6.0,NaN
3,C123,113803,3,1,3.0,NaN
4,NaN,373450,A,0,NaN,A

In [9]:
data["Cabin"].nunique()

147

r"..." ==> Treats it as a raw string (prevents escape sequence errors)
\d ==> Matches any digit (0-9)
+ ==> Matches one or more consecutive digits
() ==> Capturing group to extract the matched numbers

In [11]:
data["Cabin_numerical"] = data["Cabin"].str.extract(r"(\d+)")
data["Cabin_categorical"] = data["Cabin"].str[0]
data.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categotrial,Cabin_numerical,Cabin_categorical
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,85,C
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN
3,C123,113803,3,1,3.0,NaN,123,C
4,NaN,373450,A,0,NaN,A,NaN,NaN

In [17]:
# extract the last bit of ticket as number

data["Ticket_number"] = data["Ticket"].apply(lambda x: x.split()[-1])
data["Ticket_number"] = pd.to_numeric(
    data["Ticket_number"], downcast="integer", errors="coerce"
)

data["Ticket_categotrial"] = data["Ticket"].apply(
    lambda x: x.split()[0]
)  # categorical column will have numeric data if Ticket column doesn't have categorical data
data["Ticket_categotrial"] = np.where(
    data["Ticket_categotrial"].str.isdigit(), np.nan, data["Ticket_categotrial"]
)
data.sample(5)

,Cabin,Ticket,number,Survived,number_numerical,number_categotrial,Cabin_numerical,Cabin_categorical,Ticket_number,Ticket_categotrial
401,NaN,341826,2,0,2.0,NaN,NaN,NaN,341826.0,NaN
368,NaN,14313,3,1,3.0,NaN,NaN,NaN,14313.0,NaN
662,E58,5727,A,0,NaN,A,58,E,5727.0,NaN
625,D50,36963,3,0,3.0,NaN,50,D,36963.0,NaN
299,B58 B60,PC 17558,1,1,1.0,NaN,58,B,17558.0,PC